window.puzzle1 = {//배열안은 객체, 객체안은 배열 이렇게 하는게 찾기쉬우ㅜㅁ
  title:'1번퍼즐',
  colKeys: [
    {
      num: 1, hint: '머리, 안전○○, 밀집○○'
    },
    {
      num: 2, hint: '물건, 통화, 따르릉'
    },
    {
      num: 4, hint: '구름, 풍선, ○○○○뜨다'
    },
    {
      num: 6, hint: '놀이기구, 놀이터, 오르락내리락'
    },
    {
      num: 8, hint: '동물, 바다, 다리10개'
    },
  ],
  rowKeys: [
    {
      num: 1, hint: '곤충, 여름, 피'
    },
    {
      num: 3, hint: '장소, 목욕, 변기'
    },
    {
      num: 5, hint: '악기, 두드리다, 딩동댕'
    },
    {
      num: 7, hint: '이동수단, 불, 119'
    },
    {
      num: 8, hint: '동물, 꽥꽥, 뒤뚱뒤뚱'
    },
  ],
  tableArr: [//중첩배열사용해야함.여백이 있으면 안됨
    ['', '', '', '', '', '모', '자'],
    ['', '', '', '전', '화', '기', ''],
    ['시', '소', '', '', '장', '', ''],
    ['', '방', '', '둥', '실', '둥', '실'],
    ['', '차', '', '', '', '', '로'],
    ['', '', '오', '징', '어', '', '폰'],
    ['', '', '리', '', '', '', ''],
  ],
  markArr: [
    { num:1, row:0, col:5, },
    { num:2, row:1, col:3, },
    { num:3, row:1, col:4, },
    { num:4, row:3, col:3, },
    { num:5, row:3, col:6, },
    { num:6, row:2, col:0, },
    { num:7, row:2, col:1, },
    { num:8, row:5, col:2, },
  ]
}
window.puzzle2 = {//배열안은 객체, 객체안은 배열 이렇게 하는게 찾기쉬우ㅜㅁ
  title:'2번퍼즐',
  colKeys: [
    {
      num: 1, hint: '아웃렛백화점'
    },
    {
      num: 2, hint: '물건, 통화, 따르릉'
    },
    {
      num: 4, hint: '구름, 풍선, ○○○○뜨다'
    },
    {
      num: 6, hint: '놀이기구, 놀이터, 오르락내리락'
    },
    {
      num: 8, hint: '동물, 바다, 다리10개'
    },
  ],
  rowKeys: [
    {
      num: 1, hint: '곤충, 여름, 피'
    },
    {
      num: 3, hint: '장소, 목욕, 변기'
    },
    {
      num: 5, hint: '악기, 두드리다, 딩동댕'
    },
    {
      num: 7, hint: '이동수단, 불, 119'
    },
    {
      num: 8, hint: '동물, 꽥꽥, 뒤뚱뒤뚱'
    },
  ],
  tableArr: [//중첩배열사용해야함.여백이 있으면 안됨
    ['', '', '', '', '', '모', '다'],
    ['', '', '', '전', '화', '기', ''],
    ['시', '소', '', '', '장', '', ''],
    ['', '방', '', '둥', '실', '둥', '실'],
    ['', '차', '', '', '', '', '로'],
    ['', '', '오', '징', '어', '', '폰'],
    ['', '', '리', '', '', '', ''],
  ],
  markArr: [
    { num:1, row:0, col:5, },
    { num:2, row:1, col:3, },
    { num:3, row:1, col:4, },
    { num:4, row:3, col:3, },
    { num:5, row:3, col:6, },
    { num:6, row:2, col:0, },
    { num:7, row:2, col:1, },
    { num:8, row:6, col:2, },
  ]
}