<?php include 'sub-header.php' ?>
<script src="./js/faq.js"></script>
<h2 class="sub_title">FAQ</h2>

<section class=faq_section>
  <p class="site_guide">
    아코디언 메뉴를 이용한 질문목록 리스트를 설계하였습니다.
    <button>
      <i class="fa-regular fa-circle-xmark"></i>
    </button>
  </p>

  <p class="sub_desc">
    <em class="emphasis">자주 물으시는 질문은 여기서 확인하실 수 있습니다.</em> <br> 질문에 대한 궁금증을 빠르게 해결해드립니다.
  </p>

  <ul class="faq_list">
    <li>
      <button>
        1. 여행상담은 어떤 식으로 이루어지나요?
      </button>
      <!-- 상호작용을 하기 위해 버튼 만듦 -->
      <p>
        선샤인의 여행상담은 1:1대면, 혹은 비대면 상담으로 고객님이 원하는 방식으로 이루어집니다. 상담을 위해서 문의사항 혹은 대표번호로 문의 주시기 바랍니다. 더 자세한 내용은 온라인 문의 게시판에 남겨주시면 친절하게 안내드리겠습니다.
      </p>
    </li>
    <li>
      <button>2. 여행지를 선정하지 못한 경우는 어떻게 되나요?</button>
      <!-- 상호작용을 하기 위해 버튼 만듦 -->
      <p>
        저희 선샤인에서는 고객님의 니즈에 맞춘 여행 상품을 제공합니다. 여행상품에는 고객님의 취향에 맞춘 나라, 도시등의 선택도 가능합니다. 상담을 통해서 고객님이 원하는 여행지를 선택해보세요. 더 자세한 내용은 온라인 문의 게시판에 남겨주시면 친절하게 안내드리겠습니다.
      </p>
    </li>
    <li>
      <button>3. 환불 절차는 어떻게 되나요?</button>
      <!-- 상호작용을 하기 위해 버튼 만듦 -->
      <p>
        선샤인의 여행상품은 시작부터 끝까지 고객님의 니즈에 맞추어 분석 및 기획에 들어가기때문에 진행 단계에 따라 환불액이 달라질 수 있습니다. 더 자세한 내용은 온라인 문의 게시판에 남겨주시면 친절하게 안내드리겠습니다.
      </p>
    </li>
    <li>
      <button>4. 중간에 인원 추가도 가능한가요?</button>
      <!-- 상호작용을 하기 위해 버튼 만듦 -->
      <p>
        대부분의 경우 인원추가가 가능하며, 만약 비행기표와 숙박지가 결정된 경우에는 추가금이 발생할 수 있습니다. 이 점을 유념하시어 인원이 추가되는 경우에는 가능한 한 빨리 알려주시면 추가금 없이 이용 가능하십니다. 더 자세한 내용은 온라인 문의 게시판에 남겨주시면 친절하게 안내드리겠습니다.
      </p>
    </li>
    <li>
      <button>5. 스냅사진은 어떻게 진행할 수 있나요?</button>
      <!-- 상호작용을 하기 위해 버튼 만듦 -->
      <p>
        저희 선샤인에서는 지역의 커뮤니티와 연결된 사진작가님들이 계십니다. 만약 고객님이 여행하시는 지역에 연결된 사진작가님이 없는경우에는, 선샤인에서 직접 사진작가를 섭외하여 여행지에서의 추억을 담을 수 있는 스냅사진을 남겨드립니다. 더 자세한 내용은 온라인 문의 게시판에 남겨주시면 친절하게 안내드리겠습니다.
      </p>
    </li>
  </ul>


</section>
<?php include 'sub-footer.php' ?>